{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "id2label": {
    "0": "actinic_keratoses",
    "1": "basal_cell_carcinoma",
    "2": "benign_keratosis-like_lesions",
    "3": "dermatofibroma",
    "4": "melanoma",
    "5": "melanocytic_Nevi",
    "6": "vascular_lesions"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "actinic_keratoses": 0,
    "basal_cell_carcinoma": 1,
    "benign_keratosis-like_lesions": 2,
    "dermatofibroma": 3,
    "melanocytic_Nevi": 5,
    "melanoma": 4,
    "vascular_lesions": 6
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 16,
  "num_channels": 3,
  "num_hidden_layers": 24,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 1024,
  "qkv_bias": true,
  "transformers_version": "5.6.2",
  "use_cache": false
}
